#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.main_bucket: Refreshing state... [id=corentin-ducatez-resume-bucket-30-merge]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy_allow_public_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_allow_public_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::corentin-ducatez-resume-bucket-30-merge/*",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_s3_bucket.main_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "main_bucket" {
      + force_destroy               = true
        id                          = "corentin-ducatez-resume-bucket-30-merge"
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_ownership_controls.ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = "corentin-ducatez-resume-bucket-30-merge"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.policy_allow_public_access will be created
  + resource "aws_s3_bucket_policy" "policy_allow_public_access" {
      + bucket = "corentin-ducatez-resume-bucket-30-merge"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "corentin-ducatez-resume-bucket-30-merge"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_versioning.versioning_enabled will be created
  + resource "aws_s3_bucket_versioning" "versioning_enabled" {
      + bucket = "corentin-ducatez-resume-bucket-30-merge"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "bucket_website_configuration" {
      + bucket           = "corentin-ducatez-resume-bucket-30-merge"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Deprecated attribute

  on outputs.tf line 3, in output "website_endpoint":
   3:   value = aws_s3_bucket.main_bucket.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pushed by: @Wasta-Geek, Action: `pull_request`*